Repository: haythem-dev/ibt_cdm_uadm
Catalog: pharmos.*.uadm_last/dev/src/wincs/UadmWebLoginService/App_GlobalResources/Resources.*.resx
Languages: de

# LabelApplication
source: Application
de: Anwendung

# LabelCountry
source: Country
de: Land

# LabelEnvironment
source: Environment
de: Umgebung

# LabelLanguage
source: Language
de: Sprache

# LabelPassword
source: Password
de: Passwort

# LabelRegionOrBranch
source: Region
de: Region oder Filiale

# LabelUsername
source: Username
de: Benutzerkennung

source: Login
de: Anmelden

# LabelNewPassword2
source: New Password 2
de: Neues Passwort 2

# LabelOldPassword
source: Old Password
de: Altes Passwort

# LabelChangePassword
source: Change Password
de: Passwort ändern

# LabelNewPassword1
source: New Password 1
de: Neues Passwort 1

# ButtonChangePW
source: Change PW
de: Ändern

# ButtonCancelPW
source: Cancel
de: Abbruch

# TitleNewPassword
source: New Password
de: Neues Passwort

# TitleLogin
source: Login
de: Anmeldung

# ErrorFieldsRequired
source: Please fill in all required fields.
de: Bitte alle Felder ausfüllen.

# ErrorUadmConnection
source: UADM connection error
de: UADM Verbindungsfehler

# ErrorLoginFailed
source: Login Failed. Please check your credentials
de: Anmeldung fehlgeschlagen. Bitte prüfen sie die Eingaben

# ValidationUsername
source: Please enter the username
de: Bitte geben Sie einen Benutzernamen ein

# ValidationPassword
source: Please enter the password
de: Bitte geben Sie ein Passwort ein

# ValidationEnvironment
source: Please select an environment
de: Bitte wählen Sie eine Umgebung

# ValidationCountry
source: Please select a country
de: Bitte wählen Sie ein Land

# ValidationBranchRegion
source: Please select a branch/region
de: Bitte wählen Sie eine Filiale oder Region

# ValidationLanguage
source: Please select a language
de: Bitte wählen Sie eine Sprache

# ValidationNewPassword1
source: Please enter a new password
de: Bitte geben Sie ein neue Passwort ein

# ValidationNewPassword2
source: Please enter the verification password
de: Bitte geben Sie das Kontroll Passwort ein

# ErrorCurrentPasswordRequired
source: Current password is missing
de: Das aktuelle Passwort fehlt

# ErrorNewPassword1Required
source: New password is missing
de: Das neue Passwort fehlt

# ErrorNewPassword2Required
source: Verify password is missing
de: Das Kontroll Passwort fehlt

# ErrorNewPasswordEqualOldPassword
source: New password must be different
de: Das neue Passwort muss anders sein

# ErrorNewPasswordVerification
source: New passwords not identical
de: Neue Passwörter nicht identisch

# ErrorResponseCouldNotInitialize
source: UADM could not initialize
de: UADM Initialisierung fehlgeschlagen

# ErrorResponseManagerIsNull
source: UADM connection error (Manager)
de: UADM Verbindungsfehler (Manager)

# ErrorResponseNoEnvironmentFound
source: UADM no environment found
de: UADM Kein Environment

# ErrorResponseCouldNotVerifyUser
source: Could not verify user
de: Benutzer konnte nicht verifiziert werden

# ErrorResponseUserIsNotAuthenticated
source: User is not authenticated
de: Benutzer ist nicht authentisiert

# ErrorResponseUserIsNotActivated
source: User is not active
de: Benutzer ist nicht aktiv

# ErrorResponseHistoryVerifyFailed
source: History verify failed
de: Passwort History Problem

# ErrorResponseNoPreviousLoginDataFound
source: No previous login data
de: Probleme mit vorangegangenen Login Daten

# ErrorResponsePasswordNotValidNewRules
source: Your new password does not fit the password rules: 8-64 chars, allowed a-z, A-Z, 0-9, !()=+#,.-;:_ {}[], min 2 of categories (uppercase, lowercase, special char or digit).
de: Ihr neues Passwort entspricht nicht den Passwort-Richtlinien: 8-64 Zeichen, erlaubt sind a-z, A-Z, 0-9, !()=+#,.-;:_ {}[], min. 2 der Kategorien (Großbuchstaben, Kleinbuchstaben, Sonderzeichen oder Ziffern).

# ErrorResponsePasswordNotValidOldRules
source: Your new password does not fit the password rules: 6-8 chars, allowed a-z, A-Z, 0-9, !()=+#,.-;:_ {}[], min. 2 of categories (uppercase, lowercase, special char or digit).
de: Ihr neues Passwort entspricht nicht den Passwort-Richtlinien: 6-8 Zeichen, erlaubt sind a-z, A-Z, 0-9, !()=+#,.-;:_ {}[], min. 2 der Kategorien (Großbuchstaben, Kleinbuchstaben, Sonderzeichen oder Ziffern).

# ErrorResponseSavePasswordFailed
source: Save password failed
de: Speichern des neuen Passworts fehlgeschlagen

# ErrorResponseLoginInterfaceIsNull
source: UADM connection error (LoginInterface)
de: UADM Verbindungsfehler (LoginInterface)

# ErrorNewPasswordLength
source: New password must be at least 6 characters
de: Das neue Passwort muss mindestens 6 Zeichen lang sein

# ErrorUsernameRequired
source: Current username is missing
de: Der Benutzername fehlt

# ValidationPasswordChangeRequired
source: Password change is required
de: Passwort muss geändert werden
